
# tap repositories and their packages

brew "ansible"
brew "asitop"
brew "azure-cli"
brew "chezmoi"
brew "coreutils"
brew "direnv"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "git-flow-avh"
brew "jemalloc"
brew "krew"
brew "kubie"
brew "Azure/kubelogin/kubelogin"
brew "libpq"
brew "mise"
brew "neovim"
brew "starship"
brew "teleport"
brew "vips"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

cask "1password"
cask "1password-cli"
cask "nikitabobko/tap/aerospace"
cask "alacritty"
cask "alfred"
cask "domzilla-caffeine"
cask "clickup"
cask "docker"
cask "elgato-control-center"
cask "firefox"
cask "google-cloud-sdk"
cask "grammarly-desktop"
cask "jetbrains-toolbox"
cask "kap"
cask "little-snitch"
cask "micro-snitch"
cask "microsoft-azure-storage-explorer"
cask "microsoft-office"
cask "microsoft-teams"
cask "miro"
cask "notion"
cask "obs"
cask "postman"
cask "proton-drive"
cask "proton-mail"
cask "protonvpn"
cask "readwise-ibooks"
cask "signal"
cask "slack"
cask "spotify"
cask "vorta"
cask "warp"
cask "xquartz"
cask "yubico-authenticator"
cask "yubico-yubikey-manager"

cask "focusrite-control"

cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"

# Other Cask applications
cask "luna-display"
