
# tap repositories and their packages

brew "ansible"
brew "asitop"
brew "azure-cli"
brew "btop"
brew "chezmoi"
brew "coreutils"
brew "direnv"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "git-delta"
brew "jemalloc"
brew "krew"
brew "kubie"
brew "lazygit"
brew "libpq"
brew "mise"
brew "neovim"
brew "starship"
brew "teleport"
brew "vips"
brew "zellij"
brew "zoxide"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

cask "1password"
cask "1password-cli"
cask "alfred"
cask "claude"
cask "docker-desktop"
cask "elgato-control-center"
cask "firefox"
cask "ghostty"
cask "grammarly-desktop"
cask "jetbrains-toolbox"
cask "kap"
cask "little-snitch"
cask "micro-snitch"
cask "microsoft-azure-storage-explorer"
cask "microsoft-office"
cask "microsoft-teams"
cask "miro"
cask "notion"
cask "obs"
cask "postman"
cask "proton-drive"
cask "proton-mail"
cask "protonvpn"
cask "rectangle"
cask "readwise-ibooks"
cask "signal"
cask "slack"
cask "spotify"
cask "vorta"
cask "yubico-authenticator"
cask "zen"
cask "focusrite-control"

cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"

